Repository: dotnet/java-interop
Catalog: src/Java.Interop.Localization/Resources.*.resx
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CecilResolver_XA0009
source: Error while loading assembly: '{0}'.
cs: Chyba při načítání sestavení:{0}
de: Fehler beim Laden der Assembly: „{0}“.
es: Error al cargar el ensamblaje: "{0}".
fr: Erreur lors du chargement de l'assemblage : '{0}'.
it: Errore durante il caricamento dell'assembly: '{0}'.
ja: アセンブリの読み込み時のエラー: '{0}'。
ko: 어셈블리 로드 중 오류: '{0}'.
pl: Błąd podczas ładowania motywu: „{0}”
pt_br: Erro ao carregar o assembly: '{0}'.
ru: Ошибка при загрузке сборки: "{0}".
tr: Derleme yüklenirken hata oluştu: '{0}'.
zh_hans: 加载程序集“{0}”时出错。
zh_hant: 載入組件: '{0}' 時發生錯誤。

# Generator_BG4000
source: Failed to remove old constants: {0}.
cs: Nepodařilo se odebrat staré konstanty: {0}.
de: Fehler beim Entfernen alter Konstanten: {0}.
es: Ha ocurrido un error al eliminar las constantes antiguas: {0}.
fr: Impossible de supprimer les anciennes constantes : {0}.
it: Impossibile rimuovere le costanti precedenti: {0}.
ja: 古い定数を削除できませんでした: {0}。
ko: 이전 상수를 제거하지 못했습니다: {0}.
pl: Nie można usunąć starych stałych: {0}.
pt_br: Ocorreu um erro ao remover as constantes antigas: {0}.
ru: Сбой удаления старых констант: {0}.
tr: Eski sabitler kaldırılamadı: {0}.
zh_hans: 无法删除旧常量: {0}。
zh_hant: 無法移除舊的常數: {0}。

# Generator_BG4100
source: Failed to process enum mapping. Text line: {0}.
cs: Zpracování mapování výčtu se nezdařilo. Textový řádek: {0}.
de: Fehler beim Verarbeiten der Enumerationszuordnung. Textzeile: {0}.
es: Ha ocurrido un error al procesar el mapeo del enum. Línea de texto: {0}.
fr: Échec du traitement du mappage enum. Ligne de texte : {0}.
it: Impossibile elaborare il mapping dell'enumerazione. Riga di testo: {0}.
ja: 列挙型マッピングを処理できませんでした。テキスト行: {0}。
ko: 열거 매핑을 처리하지 못했습니다. 텍스트 줄: {0}.
pl: Nie można przetworzyć mapowania wyliczenia. Wiersz tekstu: {0}.
pt_br: Não foi possível processar o mapeamento de enumeração. Linha de texto: {0}.
ru: Сбой обработки сопоставления перечисления. Текстовая строка: {0}.
tr: Sabit listesi eşlemesi işlenemedi. Metin satırı: {0}.
zh_hans: 无法处理枚举映射。文本行: {0}。
zh_hant: 無法處理列舉對應。文字行: {0}。

# Generator_BG4200
source: Error during processing metadata fixup: {0}.
cs: Chyba při zpracování opravy metadat: {0}
de: Fehler beim Verarbeiten der Metadatenkorrektur: {0}.
es: Ha ocurrido un error durante el procesamiento de la corrección de metadatos: {0}.
fr: Erreur lors du traitement de la correction des métadonnées : {0}.
it: Errore durante l'elaborazione della correzione dei metadati: {0}.
ja: メタデータの修正の処理中にエラーが発生しました: {0}。
ko: 메타데이터 수정 처리 중 오류: {0}.
pl: Błąd podczas przetwarzania poprawki metadanych: {0}.
pt_br: Erro durante o processamento da correção dos metadados: {0}.
ru: Ошибка при обработке исправления метаданных: {0}.
tr: Meta veri düzeltmesi işlenirken hata oluştu: {0}.
zh_hans: 处理元数据修复期间出错: {0}。
zh_hant: 處理中繼資料修復期間發生錯誤: {0}。

# Generator_BG4300
source: Invalid XPath specification: {0}.
cs: Neplatná specifikace XPath: {0}
de: Ungültige XPath-Spezifikation: {0}.
es: Especificación XPath no válida: {0}.
fr: Spécification XPath non valide : {0}.
it: Specifica XPath non valida: {0}.
ja: XPath の指定が無効です: {0}。
ko: 잘못된 XPath 사양: {0}.
pl: Nieprawidłowa specyfikacja XPath: {0}.
pt_br: Especificação de XPath inválida: {0}.
ru: Недопустимая спецификация XPath: {0}.
tr: Geçersiz XPath belirtimi: {0}.
zh_hans: XPath 规范无效: {0}。
zh_hant: 無效的 XPath 規格: {0}。

# Generator_BG4307
source: Target attribute name is not specified for path: {0}.
cs: Pro cestu {0} není zadán název cílového atributu: {0}.
de: Für den Pfad wurde kein Zielattributname angegeben: {0}.
es: No se ha especificado el nombre del atributo de destino para la ruta: {0}.
fr: Le nom d'attribut cible n'est pas spécifié pour le chemin : {0}.
it: Il nome dell'attributo di destinazione non è specificato per il percorso: {0}.
ja: パスにターゲット属性名が指定されていません: {0}。
ko: 대상 특성 이름이 경로 {0}에 지정되지 않았습니다.
pl: Nie określono nazwy atrybutu docelowego dla ścieżki: {0}.
pt_br: O nome do atributo de destino não foi especificado para o caminho: {0}.
ru: Имя целевого атрибута не указано для пути: {0}.
tr: Yol için hedef öznitelik adı belirtilmedi: {0}.
zh_hans: 没有为路径 {0} 指定目标属性名称。
zh_hant: 未指定路徑的目標屬性名稱: {0}。

# Generator_BG4400
source: Unexpected 'global::' specification. This error happens if 'global::' is specified in the Metadata.xml transform file, for example.
cs: Neočekávaná specifikace global::. K této chybě dochází například v případě, že je v transformačním souboru Metadata.xml zadána hodnota global::.
de: Unerwartete global::-Spezifikation. Dieser Fehler tritt auf, wenn z. B. "global::" in der Metadata.xml Transformationsdatei angegeben ist.
es: Especificación inesperada de 'global::'. Este error se produce si se especifica 'global::' en el archivo de transformación Metadata.xml, por ejemplo.
fr: Spécification 'globale ::' inattendue. Cette erreur se produit si 'global ::' est spécifié dans le fichier de transformation Metadata.xml, par exemple.
it: Specifica 'global::' imprevista. Questo errore si verifica, ad esempio, se 'global::' è specificato nel file di trasformazione Metadata.xml.
ja: 予期しない 'global::' 指定です。このエラーは、Metadata.xml 変換ファイルで 'global::' が指定されている場合などに発生します。
ko: 예기치 않은 'global::' 사양입니다. 이 오류는 예를 들어 Metadata.xml 변환 파일에 'global::'이 지정된 경우 발생합니다.
pl: Nieoczekiwana specyfikacja „global::”. Ten błąd występuje, jeśli w pliku przekształcenia Metadata.xml określono na przykład wartość „global::”.
pt_br: Especificação 'global::' inesperada. Esse erro ocorre se 'global::' for especificado no arquivo de transformação Metadata.xml, por exemplo.
ru: Неожиданная спецификация "global::". Эта ошибка происходит, если, например, "global::" указан в файле преобразования Metadata.xml.
tr: Beklenmeyen 'global::' belirtimi. Bu hata, örneğin Metadata.xml dönüşüm dosyasında 'global::' belirtilirse oluşur.
zh_hans: 意外的 “global::” 规范。例如，如果在 Metadata.xml 转换文件中指定了 “global::”，则会发生此错误。
zh_hant: 未預期的 'global::' 規格。例如，如果在 Metadata.xml 轉換檔案中指定了 'global::'，就會發生此錯誤。

# Generator_BG4500
source: 'lang-features=default-interface-methods' is not compatible with 'codegen-target=xamarinandroid'.
cs: Lang-features=default-interface-methods není kompatibilní s codegen-target=xamarinandroid.
de: "lang-features=default-interface-methods" ist nicht mit "codegen-target=xamarinandroid" kompatibel.
es: "lang-features=default-interface-methods" no es compatible con "codegen-target=xamarinandroid".
fr: 'lang-features=default-interface-methods' n'est pas compatible avec 'codegen-target=xamarinandroid'.
ja: 'lang-features=default-interface-methods' は 'codegen-target=xamarinandroid' と互換性がありません。
ko: 'lang-features=default-interface-methods'는 'codegen-target=xamarinandroid'와 호환되지 않습니다.
pl: Element „lang-features=default-interface-methods” nie jest zgodny z elementem „codegen-target=xamandroid”.
pt_br: 'lang-features=default-interface-methods' é incompatível com 'codegen-target=xamarinandroid'.
ru: "lang-features=default-interface-methods" не совместим с "codegen-target=xamarinandroid".
tr: 'lang-features=default-interface-methods', 'codegen-target=xamarinandroid' ile uyumlu değil.
zh_hans: “lang-features=default-interface-methods” 与 “codegen-target=xamarinandroid” 不兼容。
zh_hant: 'lang-features=default-interface-methods' 與 'codegen-target=xamarinandroid' 不相容。

# Generator_BG8101
source: Unexpected class child {0}.
cs: Neočekávaný podřízený {0} třídy.
de: Unerwartetes untergeordnetes Klassenelement {0}.
es: Clase secundaria inesperada {0}.
fr: Enfant de classe {0} inattendu.
it: Elemento figlio classe imprevisto {0}.
ja: 予期しないクラスの子 {0} です。
ko: 예기치 않은 클래스 하위 {0}.
pl: Nieoczekiwana klasa podrzędna {0}.
pt_br: Classe filho inesperada {0}.
ru: Непредвиденный дочерний класс {0}.
tr: Beklenmeyen sınıf alt öğesi: {0}.
zh_hans: 意外的类子级 {0}。
zh_hant: 未預期的類別子系 {0}。

# Generator_BG8102
source: Class '{0}' has unknown base type '{1}'.
cs: Třída {0} má neznámý základní typ {1}.
de: Die Klasse '{0}' hat einen unbekannten Basistyp '{1}'.
es: La clase "{0}" tiene una base desconocido de tipo "{1}".
fr: La classe '{0}' a un type de base inconnu '{1}'.
it: La classe '{0}' contiene il tipo di base sconosciuto '{1}'.
ja: クラス '{0}' に不明な基本型 '{1}' があります。
ko: 클래스 '{0}'에 알 수 없는 기본 형식 '{1}'이(가) 있습니다.
pl: Klasa „{0}” ma nieznany typ podstawowy „{1}”.
pt_br: A classe '{0}' tem tipo base desconhecido '{1}'.
ru: Класс "{0}" имеет неизвестный базовый тип "{1}".
tr: '{0}' sınıfı, bilinmeyen '{1}' temel türüne sahip.
zh_hans: 类“{0}”具有未知的基类型“{1}”。
zh_hant: 類別 '{0}' 具有未知的基底型別 '{1}'。

# Generator_BG8103
source: Class '{0}' has invalid base type '{1}'.
cs: Třída {0} má neplatný základní typ {1}.
de: Die Klasse '{0}' weist einen ungültigen Basistyp '{1}' auf.
es: La clase "{0}" tiene una base inválida tipo "{1}".
fr: La classe '{0}' a un type de base '{1}' non valide.
it: La classe '{0}' ha un tipo di base non valido '{1}'.
ja: クラス '{0}' に無効な基本データ型 '{1}' があります。
ko: 클래스 '{0}'에 잘못된 기본 형식 '{1}'이(가) 있습니다.
pl: Klasa „{0}” ma nieprawidłowy typ podstawowy „{1}”.
pt_br: A classe '{0}' tem o tipo base '{1}' inválido.
ru: Класс "{0}" имеет недопустимый базовый тип "{1}".
tr: '{0}' sınıfı, geçersiz '{1}' temel türüne sahip.
zh_hans: 类“{0}”具有无效的基类型“{1}”。
zh_hant: 類別 '{0}' 的基底型別 '{1}' 無效。

# Generator_BG8200
source: Failed to parse assembly '{0}': {1}.
cs: Nepovedlo se parsovat sestavení {0} : {1}.
de: Fehler beim Analysieren der assembly-'{0}': {1}.
es: Ha ocurrido un error al analizar el ensamblaje "{0}": {1}.
fr: Échec de l'analyse de l'assembly '{0}' : {1}.
it: Impossibile analizzare l'assembly '{0}': {1}.
ja: アセンブリ '{0}' を解析できませんでした: {1}。
ko: 어셈블리 '{0}' 구문 분석 실패: {1}.
pl: Nie można przeanalizować zestawu „{0}”: {1}.
pt_br: Ocorreu um erro ao analisar o assembly '{0}': {1}.
ru: Не удалось проанализировать сборку "{0}": {1}.
tr: '{0}' derlemesi ayrıştırılamadı: {1}.
zh_hans: 无法分析程序集“{0}”: {1}。
zh_hant: 無法剖析組件 '{0}': {1}。

# Generator_BG8300
source: For constructor '{0}', could not find enclosing type '{1}'.
cs: Pro konstruktor{0} nebylo možné najít nadřazený typ {1}.
de: Für den Konstruktor '{0}' konnte der einschließende Typ '{1}' nicht gefunden werden.
es: Para el constructor "{0}", no se ha podido encontrar el tipo envolvente "{1}".
fr: Pour le constructeur '{0}', impossible de trouver le type englobant '{1}'.
it: Per il costruttore '{0}' non è stato possibile trovare il tipo di inclusione '{1}'.
ja: コンストラクター '{0}' について、それを囲む型 '{1}' が見つかりませんでした。
ko: 생성자 '{0}'의 경우 둘러싼 형식 '{1}'을(를) 찾을 수 없습니다.
pl: W przypadku konstruktora „{0}” nie można odnaleźć otaczającego typu „{1}”.
pt_br: Para o construtor '{0}', não foi possível encontrar o tipo de delimitação '{1}'.
ru: Для конструктора "{0}" не удалось найти вложенный тип "{1}".
tr: '{0}' oluşturucusu için, '{1}' kapsayan türü bulunamadı.
zh_hans: 对于构造函数“{0}”，找不到封闭类型“{1}”。
zh_hant: 對於建構函式 '{0}'，找不到封閉型別 '{1}'。

# Generator_BG8400
source: Unexpected field type `{0}` ({1}).
cs: Neočekávaný typ pole {0}({1}).
de: Unerwarteter Feldtyp "{0}" ({1}).
es: Tipo de campo inesperado "{0}" ({1}).
fr: Type de champ `{0}` ({1}) inattendu.
it: Tipo di campo '{0}' ({1}) imprevisto.
ja: 予期しないフィールドの種類 '{0}' ({1}) です。
ko: 예기치 않은 필드 형식 `{0}`({1})입니다.
pl: Nieoczekiwany typ pola „{0}” ({1}).
pt_br: Tipo de campo inesperado `{0}` ({1}).
ru: Непредвиденный тип поля "{0}" ({1}).
tr: Beklenmeyen alan türü `{0}` ({1}).
zh_hans: 意外的字段类型 `{0}` ({1})。
zh_hant: 未預期的欄位型別 '{0}' ({1})。

# Generator_BG8401_Method
source: Skipping '{0}.{1}' due to a duplicate method name. (Java type: '{2}')
cs: Přeskakuje se {0}.{1} z důvodu duplicitního názvu metody. (Typ Javy:{2})
de: "{0}.{1}" wird aufgrund eines doppelten Methodennamens übersprungen. (Java-Typ: '{2}')
es: Se ha omitido "{0}.{1}" debido a un nombre de método duplicado. (Java tipo: "{2}")
fr: Sauter '{0}.{1}' en raison d'un nom de méthode en double. (Type Java : '{2}')
it: '{0}.{1}' verrà ignorato a causa di un nome di metodo duplicato. (Tipo Java: '{2}')
ja: メソッド名が重複しているため、'{0}.{1}' をスキップしています。(Java の型: '{2}')
ko: 메소드 이름이 중복되어 '{0}.{1}'을(를) 건너뜁니다. (Java 형식: '{2}')
pl: Pomijanie typu „{0}.{1}” z powodu zduplikowanej nazwy metody. (Typ java: „{2}”)
pt_br: Ignorando '{0}.{1}' devido a um nome de método duplicado. (Tipo Java: '{2}')
ru: Пропуск "{0}.{1}" из-за дублирования имени метода. (Тип Java: "{2}")
tr: Yinelenen bir yöntem adı nedeniyle '{0}.{1}' atlanıyor. (Java türü: '{2}')
zh_hans: 由于方法名称重复，正在跳过“{0}.{1}”。(Java 类型:“{2}')
zh_hant: 因為方法名稱重複，所以略過 '{0}.{1}'。(JAVA 型別: '{2}')

# Generator_BG8401_NestedType
source: Skipping '{0}.{1}' due to a duplicate nested type name. (Java type: '{2}')
cs: Přeskakuje se {0}.{1} z důvodu duplicitního názvu vnořeného typu. (Typ Javy:{2})
de: "{0}.{1}" wird aufgrund eines doppelten geschachtelten Typnamens übersprungen. (Java-Typ: '{2}')
es: El "{0}.{1}" ha sido omitido debido a un nombre de tipo anidado duplicado. (tipo Java: "{2}")
fr: Sauter '{0}.{1}' en raison d'un nom de type imbriqué en double. (Type Java : '{2}')
it: '{0}.{1}' verrà ignorato a causa di un nome di tipo nidificato duplicato. (Tipo Java: '{2}')
ja: 入れ子にされた型名が重複しているため、'{0}.{1}' をスキップしています。(Java の型: '{2}')
ko: 중첩 형식 이름이 중복되어 '{0}.{1}'을(를) 건너뜁니다. (Java 형식: '{2}')
pl: Pomijanie elementu „{0}.{1}” z powodu zduplikowanej nazwy typu zagnieżdżonego. (Typ java: „{2}”)
pt_br: Ignorando '{0}.{1}' devido a um nome de tipo aninhado duplicado. (Tipo Java: '{2}')
ru: Пропуск "{0}.{1}" из-за дублирования имени вложенного типа. (Тип Java: "{2}")
tr: Yinelenen bir içe geçmiş tür adı nedeniyle '{0}.{1}' atlanıyor. (Java türü: '{2}')
zh_hans: 由于嵌套类型名称重复，正在跳过“{0}.{1}”。(Java 类型:“{2}')
zh_hant: 因為巢狀類型名稱重複，所以略過 '{0}.{1}'。(JAVA 型別: '{2}')

# Generator_BG8401_Property
source: Skipping '{0}.{1}' due to a duplicate field or property name. (Java type: '{2}')
cs: Přeskakuje se {0}.{1} z důvodu duplicitního názvu pole nebo vlastnosti. (Typ Javy:{2})
de: "{0}.{1}" wird aufgrund eines doppelten Feld- oder Eigenschaftsnamens übersprungen. (Java-Typ: '{2}')
es: Se ha omitido "{0}.{1}" debido a un campo o nombre de propiedad duplicado. (tipo Java: "{2}")
fr: Sauter '{0}.{1}' en raison d'un champ ou d'un nom de propriété en double. (Type Java : '{2}')
it: '{0}.{1}' verrà ignorato a causa di un nome di proprietà o campo duplicato. (tipo Java: '{2}')
ja: フィールド名またはプロパティ名が重複しているため、'{0}.{1}' をスキップしています。(Java の型: '{2}')
ko: 중복 필드 또는 속성 이름으로 인해 '{0}.{1}'을(를) 건너뜁니다. (Java 형식: '{2}')
pl: Pomijanie elementu „{0}.{1}” z powodu zduplikowanej nazwy pola lub właściwości. (Typ java: „{2}”)
pt_br: Ignorando '{0}.{1}' devido a um campo duplicado ou nome da propriedade. (Tipo Java: '{2}')
ru: Пропуск "{0}.{1}" из-за дублирования имени поля или свойства. (Тип Java: "{2}")
tr: Yinelenen bir alan veya özellik adı nedeniyle '{0}.{1}' atlanıyor. (Java türü: '{2}')
zh_hans: 由于字段或属性名称重复，正在跳过“{0}.{1}”。(Java 类型:“{2}”)
zh_hant: 因為欄位或屬性名稱重複，所以略過 '{0}.{1}'。(JAVA 型別: '{2}')

# Generator_BG8402
source: Skipping '{0}.{1}' due to a duplicate field. (Java type: '{2}')
cs: Přeskakuje se {0}.{1} kvůli duplicitnímu poli. (Typ Javy:{2})
de: "{0}.{1}" wird aufgrund eines doppelten Felds übersprungen. (Java-Typ: '{2}')
es: Se ha omitido "{0}.{1}" debido a un campo duplicado. (tipo Java: "{2}")
fr: Sauter '{0}.{1}' en raison d'un champ en double. (Type Java : '{2}')
it: '{0}.{1}' verrà ignorato a causa di un campo duplicato. (Tipo Java: '{2}')
ja: フィールドが重複しているため、'{0}.{1}' をスキップしています。(Java の型: '{2}')
ko: 중복 필드로 인해 '{0}.{1}'을(를) 건너뜁니다. (Java 형식: '{2}')
pl: Pomijanie elementu „{0}.{1}” z powodu zduplikowanego pola. (Typ java: „{2}”)
pt_br: Ignorando '{0}.{1}' devido a um campo duplicado. (Tipo Java: '{2}')
ru: Пропуск "{0}.{1}" из-за дублирования поля. (Тип Java: "{2}")
tr: Yinelenen bir alan nedeniyle '{0}.{1}' atlanıyor. (Java türü: '{2}')
zh_hans: 由于字段重复，正在跳过“{0}.{1}”。(Java 类型:“{2}')
zh_hant: 因為欄位重複，所以略過 '{0}.{1}'。(JAVA 型別: '{2}')

# Generator_BG8500
source: Unexpected child element of '<interface>': '{0}'.
cs: Neočekávaný podřízený element <interface>: {0}
de: Unerwartetes untergeordnetes Element von '<interface>': '{0}'.
es: Elemento secundario inesperado de '<interface>': "{0}".
fr: Élément enfant inattendu de '<interface>' : '{0}'.
it: Elemento figlio imprevisto di '<interface>': '{0}'.
ja: '<interface>' の予期しない子要素です: '{0}'。
ko: '<interface>'의 예기치 않은 하위 요소: '{0}'.
pl: Nieoczekiwany element podrzędny „<interface>”: „{0}”.
pt_br: Elemento filho inesperado de '<interface>': '{0}'.
ru: Непредвиденный элемент "<interface>": "{0}".
tr: Beklenmeyen '<interface>' alt öğesi: '{0}'.
zh_hans: “<interface>”的意外子元素:“{0}”。
zh_hant: 未預期的 '<interface>' 子項目: '{0}'。

# Generator_BG8501
source: No event name provided in '{0}.{1}'.
cs: Není zadaný žádný název události v {0}.{1}.
de: In "{0}.{1}" wurde kein Ereignisname angegeben.
es: No se ha proporcionado ningún nombre de evento en "{0}.{1}".
fr: Aucun nom d'événement fourni dans '{0}.{1}'.
it: Nessun nome di evento specificato in '{0}.{1}'.
ja: '{0}.{1}' にイベント名が指定されていません。
ko: '{0}.{1}'에 이벤트 이름이 제공되지 않았습니다.
pl: Nie podano nazwy zdarzenia w typie „{0}.{1}”.
pt_br: Nenhum nome de evento fornecido em '{0}.{1}'.
ru: Имя события не указано в "{0}.{1}".
tr: '{0}.{1}' içinde sağlanmış olay adı yok.
zh_hans: “{0}.{1}”中未提供任何事件名称。
zh_hant: '{0}.{1}' 中未提供事件名稱。

# Generator_BG8502
source: Invalidating '{0}' and all its nested types because some of its interfaces were invalid.
cs: Probíhá zneplatnění {0} a všech jeho vnořených typů, protože některá z jeho rozhraní byla neplatná.
de: '{0}' und alle geschachtelten Typen werden ungültig, da einige ihrer Schnittstellen ungültig waren.
es: Invalidando "{0}" y todos sus tipos anidados porque algunas de sus interfaces no eran válidas.
fr: Invalidation de '{0}' et de tous ses types imbriqués car certaines de ses interfaces étaient invalides.
it: Convalida di '{0}' e di tutti i relativi tipi nidificati perché alcune interfacce non sono valide.
ja: 一部のインターフェイスが無効であったため、'{0}' とその入れ子にされたすべての型を無効にしています。
ko: 일부 인터페이스가 잘못되어 '{0}' 및 모든 중첩 형식을 무효화합니다.
pl: Unieważnienie elementu „{0}” i wszystkich jego typów zagnieżdżonych, ponieważ niektóre z jego interfejsów były nieprawidłowe.
pt_br: Invalidando '{0}' e todos os seus tipos aninhados, pois algumas das suas interfaces eram inválidas.
ru: Аннулирование "{0}" и всех его вложенных типов из-за недопустимости некоторых его интерфейсов.
tr: Bazı arabirimleri geçersiz olduğundan '{0}' ve tüm içe geçmiş türleri geçersiz kılınıyor.
zh_hans: 正在使“{0}”及其所有嵌套类型失效，因为其某些接口无效。
zh_hant: 正在使 '{0}' 及其所有巢狀型別失效，因為其某些介面無效。

# Generator_BG8503
source: Invalidating '{0}' and all its nested types because some of its methods were invalid.
cs: Probíhá zneplatnění {0} a všech jeho vnořených typů, protože některé z jeho metod byly neplatné.
de: '{0}' und alle geschachtelten Typen werden ungültig, da einige ihrer Methoden ungültig waren.
es: Invalidando "{0}" y todos sus tipos anidados porque algunos de sus métodos no eran válidos.
fr: Invalidation de '{0}' et de tous ses types imbriqués car certaines de ses méthodes étaient invalides.
it: Impossibile convalidare '{0}' e tutti i relativi tipi annidati perché alcuni dei relativi metodi non sono validi.
ja: 一部のメソッドが無効であったため、'{0}' とその入れ子にされたすべての型を無効にしています。
ko: 일부 메서드가 잘못되어 '{0}' 및 모든 중첩 형식을 무효화합니다.
pl: Unieważnienie elementu „{0}” i wszystkich jego typów zagnieżdżonych, ponieważ niektóre z jego metod były nieprawidłowe.
pt_br: Invalidando '{0}' e todos os seus tipos aninhados, pois alguns de seus métodos eram inválidos.
ru: Аннулирование "{0}" и всех его вложенных типов из-за недопустимых методов.
tr: Bazı yöntemleri geçersiz olduğundan '{0}' ve tüm içe geçmiş türleri geçersiz kılınıyor.
zh_hans: 正在使“{0}”及其所有嵌套类型失效，因为其某些方法无效。
zh_hant: 正在使 '{0}' 及其所有巢狀型別失效，因為其某些方法無效。

# Generator_BG8504
source: Event name for '{0}.{1}' is invalid. A valid 'eventName' or 'argsType' can be assigned by adding a rule to the Metadata.xml transforms file.
cs: Název události pro {0}.{1} je neplatný. Platnou hodnotu eventName nebo argsType lze přiřadit přidáním pravidla do souboru transformací Metadata.xml.
de: Der Ereignisname für "{0}.{1}" ist ungültig. Ein gültiger eventName- oder argsType-Wert kann zugewiesen werden, indem der Metadata.xml Transformationsdatei eine Regel hinzugefügt wird.
es: El nombre del evento para "{0}.{1}" no es válido. Se puede asignar un 'eventName' o 'argsType' válido agregando una regla al archivo de transformaciones Metadata.xml.
fr: Nom de l'événement pour '{0}.{1}' est invalide. Un 'eventName' ou 'argsType' valide peut être attribué en ajoutant une règle au fichier de transformations Metadata.xml.
it: Il nome dell'evento per '{0}.{1}' non è valido. È possibile assegnare un valore 'eventName' o 'argsType' valido aggiungendo una regola al file di trasformazioni Metadata.xml.
ja: '{0}.{1}' のイベント名が無効です。Metadata.xml 変換ファイルにルールを追加すると、有効な 'eventName' または 'argsType' を割り当てることができます。
ko: '{0}.{1}'의 이벤트 이름이 잘못되었습니다. Metadata.xml 변환 파일에 규칙을 추가하여 유효한 'eventName' 또는 'argsType'을 할당할 수 있습니다.
pl: Nazwa zdarzenia „{0}.{1}” jest nieprawidłowa. Prawidłowy element „eventName” lub „argsType” można przypisać, dodając regułę do pliku przekształceń Metadata.xml.
pt_br: O nome do evento para '{0}.{1}' é inválido. Um 'eventName' ou 'argsType' válido pode ser atribuído adicionando uma regra ao arquivo de transformações Metadata.xml.
ru: Недопустимое имя события для "{0}.{1}". Допустимые "eventName" или "argsType" можно назначить, добавив правило в файл преобразований Metadata.xml.
tr: '{0}.{1}' için olay adı geçersiz. Metadata.xml dönüşümleri dosyasına bir kural eklenerek geçerli bir 'eventName' veya 'argsType' atanabilir.
zh_hans: “{0}.{1}”的事件名称无效。可以通过将规则添加到 Metadata.xml 转换文件来分配有效的 “eventName” 或 “argsType”。
zh_hant: '{0}.{1}' 的事件名稱無效。將規則新增至 Metadata.xml 轉換檔案，即可指派有效的 'eventName' 或 'argsType'。

# Generator_BG8506
source: Event property name for '{0}.{1}' is invalid. A valid 'eventName' or 'argsType' can be assigned by adding a rule to the Metadata.xml transforms file.
cs: Název vlastnosti události pro {0}.{1} je neplatný. Platnou hodnotu eventName nebo argsType lze přiřadit přidáním pravidla do souboru transformací Metadata.xml.
de: Der Ereigniseigenschaftsname für "{0}.{1}" ist ungültig. Ein gültiger eventName- oder argsType-Wert kann zugewiesen werden, indem der Metadata.xml Transformationsdatei eine Regel hinzugefügt wird.
es: El nombre de la propiedad del evento para "{0}.{1}" no es válido. Se puede asignar un 'eventName' o 'argsType' válido agregando una regla al archivo de transformaciones Metadata.xml.
fr: Nom de la propriété d'événement pour '{0}.{1}' est invalide. Un 'eventName' ou 'argsType' valide peut être attribué en ajoutant une règle au fichier de transformations Metadata.xml.
it: Il nome della proprietà dell'evento per '{0}.{1}' non è valido. È possibile assegnare un valore 'eventName' o 'argsType' valido aggiungendo una regola al file di trasformazioni Metadata.xml.
ja: '{0}.{1}' のイベント プロパティ名が無効です。Metadata.xml 変換ファイルにルールを追加すると、有効な 'eventName' または 'argsType' を割り当てることができます。
ko: '{0}.{1}'의 이벤트 속성 이름이 잘못되었습니다. Metadata.xml 변환 파일에 규칙을 추가하여 유효한 'eventName' 또는 'argsType'을 할당할 수 있습니다.
pl: Nazwa właściwości zdarzenia „{0}.{1}” jest nieprawidłowa. Prawidłowy element „eventName” lub „argsType” można przypisać, dodając regułę do pliku przekształceń Metadata.xml.
pt_br: O nome da propriedade do evento para '{0}.{1}' é inválido. Um 'eventName' ou 'argsType' válido pode ser atribuído adicionando uma regra ao arquivo de transformações Metadata.xml.
ru: Недопустимое имя свойства события для "{0}.{1}". Допустимое значение "eventName" или "argsType" можно назначить, добавив правило в файл преобразований Metadata.xml.
tr: '{0}.{1}' için olay özelliği adı geçersiz. Metadata.xml dönüşümleri dosyasına bir kural eklenerek geçerli bir 'eventName' veya 'argsType' atanabilir.
zh_hans: “{0}.{1}”的事件属性名称无效。可以通过将规则添加到 Metadata.xml 转换文件来分配有效的 “eventName” 或 “argsType”。
zh_hant: '{0}.{1}' 的事件屬性名稱無效。將規則新增至 Metadata.xml 轉換檔案，即可指派有效的 'eventName' 或 'argsType'。
