Repository: dotnet/java-interop
Catalog: src/Java.Interop.Localization/Resources.*.resx
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Generator_BG8600
source: Invalid XML file '{0}': {1}.
cs: Neplatný soubor XML{0}: {1}.
de: Ungültige XML-Datei „{0}“: {1}.
es: Archivo XML no válido "{0}": {1}.
fr: Fichier XML '{0}' non valide : {1}.
it: Il file XML '{0}' non è valido: {1}.
ja: XML ファイル '{0}' が無効です: {1}。
ko: 잘못된 XML 파일 '{0}': {1}.
pl: Nieprawidłowy plik XML „{0}”: {1}.
pt_br: Arquivo XML inválido '{0}': {1}.
ru: Недопустимый XML-файл "{0}": {1}.
tr: '{0}' XML dosyası geçersiz: {1}.
zh_hans: XML 文件“{0}”无效: {1}。
zh_hant: 無效的 XML 檔案'{0}': {1}。

# Generator_BG8601
source: No '<package>' elements found.
cs: Nebyly nalezeny žádné elementy <package>.
de: Es wurden keine '<package>' Elemente gefunden.
es: No se han encontrado los elementos '<package>'.
fr: Aucun élément '<package>' trouvé.
it: Non sono stati trovati elementi '<package>'.
ja: '<package>' 要素が見つかりません。
ko: '<package>' 요소를 찾을 수 없습니다.
pl: Nie znaleziono elementów „<package>”.
pt_br: Nenhum elemento '<package>' foi encontrados.
ru: Элементы "<package>" не найдены.
tr: '<package>' öğeleri bulunamadı.
zh_hans: 找不到“<package>”元素。
zh_hant: 找不到 '<package>' 元素。

# Generator_BG8602
source: Unexpected root child node: '<{0}>'.
cs: Neočekávaný kořenový podřízený uzel: <{0}>.
de: Unerwarteter untergeordneter Stammknoten: "<{0}>".
es: Raíz de nodo secundario inesperado: "<{0}>".
fr: Nœud enfant racine inattendu : '<{0}>'.
it: Nodo figlio radice imprevisto: '<{0}>'.
ja: 予期しないルートの子ノード: '<{0}>'。
ko: 예기치 않은 루트 하위 노드: '<{0}>'.
pl: Nieoczekiwany główny węzeł podrzędny: „<{0}>”.
pt_br: Nó filho raiz inesperado: '<{0}>'.
ru: Непредвиденный корневой дочерний узел: "<{0}>".
tr: Beklenmeyen kök alt düğüm: '<{0}>'.
zh_hans: 意外的根子节点:“<{0}>”。
zh_hant: 未預期的根子節點: '<{0}>'。

# Generator_BG8603
source: Unexpected '<package>' child node: '<{0}>'.
cs: Neočekávaný podřízený uzel <package>: <{0}>
de: Unerwarteter '<package>' untergeordneter Knoten: "<{0}>".
es: Nodo secundario inesperado de "<package>": "<{0}>".
fr: Nœud enfant '<package>' inattendu : '<{0}>'.
it: Nodo figlio '<package>' imprevisto: '<{0}>'.
ja: 予期しない '<package>' 子ノードです: '<{0}>'。
ko: 예기치 않은 '<package>' 하위 노드: '<{0}>'.
pl: Nieoczekiwany węzeł podrzędny „<package>”: „<{0}>”.
pt_br: Nó filho '<package>' inesperado: '<{0}>'.
ru: Непредвиденный дочерний узел "<package>": "<{0}>".
tr: Beklenmeyen '<package>' alt düğümü: '<{0}>'.
zh_hans: 意外的“<package>”子节点:“<{0}>”。
zh_hant: 未預期的 '<package>' 子節點: '<{0}>'。

# Generator_BG8604
source: Could not find top ancestor type '{0}' for nested type '{1}'.
cs: Nelze najít horní nadřazený typ {0} pro vnořený typ {1}.
de: Der oberste Vorgängertyp '{0}' für geschachtelten Typ '{1}' wurde nicht gefunden.
es: No se ha podido encontrar el tipo antecesor superior "{0}" para el tipo anidado "{1}".
fr: Impossible de trouver le type d'ancêtre supérieur '{0}' pour le type imbriqué '{1}'.
it: Non è stato possibile trovare il tipo predecessore principale '{0}' per il tipo nidificato '{1}'.
ja: 入れ子にされた型 '{0}' の上位先祖型 '{1}' が見つかりませんでした。
ko: 중첩 형식 '{1}'에 대한 상위 상위 항목 형식 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć typu elementu nadrzędnego „{0}” dla zagnieżdżonego typu „{1}”.
pt_br: Não foi possível encontrar o tipo de ancestral superior '{0}' para o tipo aninhado '{1}'.
ru: Не удалось найти тип верхнего предка "{0}" для вложенного типа "{1}".
tr: '{1}' iç içe geçmiş türü için '{0}' üst türü bulunamadı.
zh_hans: 找不到嵌套类型“{1}”的顶级上级类型“{0}”。
zh_hant: 找不到巢狀型別 '{1}' 的上階型別 '{0}'。

# Generator_BG8605
source: The Java type '{0}' could not be found (are you missing a Java reference jar/aar or a Java binding library NuGet?)
cs: Typ Javy{0}se nepovedlo najít (nechybí NuGet java reference jar/aar nebo java binding library?)
de: Der Java-Typ '{0}' wurde nicht gefunden . (Fehlt ein Java-Verweis-JAR/AAR oder eine Java-Bindungsbibliothek, NuGet?).
es: No se ha podido encontrar el tipo de Java "{0}" (¿le falta un jar/aar de referencia de Java o una biblioteca de enlace de Java NuGet?)
fr: Le type Java '{0}' est introuvable (manque-t-il une référence Java jar/aar ou une bibliothèque de liaison Java NuGet ?)
it: Non è stato possibile trovare il tipo Java '{0}' (manca un file jar/aar di riferimento Java o una libreria di binding Java NuGet?)
ja: Java の型 '{0}' が見つかりませんでした (Java 参照 jar/aar または Java バインド ライブラリ NuGet が不足していないかどうかを確認してください。)
ko: Java 형식 '{0}'을(를) 찾을 수 없습니다(Java 참조 jar/aar 또는 Java 바인딩 라이브러리 NuGet이 누락되었습니까?)
pl: Nie można odnaleźć typu języka Java „{0}” (czy brakuje pliku jar/aar odwołania Java lub NuGet biblioteki powiązań Java?)
pt_br: Não foi possível encontrar o tipo Java '{0}' (está faltando um jar/aar de referência Java ou uma biblioteca de vinculação Java NuGet?)
ru: Не удалось найти тип Java "{0}" (может быть, вам не хватает справочного файла jar/aar Java или библиотеки привязки Java NuGet?)
tr: '{0}' Java türü bulunamadı (Java başvuru JAR/AAR veya Java bağlama kitaplığı NuGet paketleri eksik mi?)
zh_hans: 找不到 Java 类型“{0}”(是否缺少 Java 引用 jar/aar 或 Java 绑定库 NuGet?)
zh_hant: 找不到 JAVA 型別 '{0}' (您是否遺漏 JAVA 參考 jar/aar 或 JAVA 繫結程式庫 NuGet?)

# Generator_BG8606
source: Some types or members could not be bound because referenced Java types could not be found. See the 'java-resolution-report.log' file for details.
cs: Některé typy nebo členy nelze vázat, protože odkazované typy Java nebyly nalezeny. Podrobnosti najdete v souboru java-resolution-report.log.
de: Einige Typen oder Member konnten nicht gebunden werden, da die referenzierten Javatypen nicht gefunden wurden. Weitere Informationen finden Sie in der Datei "java-resolution-report.log".
es: Algunos tipos o miembros no han podido ser vinculados debido a que no se han podido encontrar los tipos Java referenciados. Consulte el archivo "java-resolution-report.log" para más detalles.
fr: Certains types ou membres n'ont pas pu être liés car les types Java référencés sont introuvables. Voir le fichier 'java-resolution-report.log' pour plus de détails.
it: Non è stato possibile associare alcuni tipi o membri perché non è stato possibile trovare i tipi Java a cui viene fatto riferimento. Per informazioni dettagliate, vedere il file 'java-resolution-report.log'.
ja: 参照されている Java の型が見つからなかったため、一部の型またはメンバーをバインドできませんでした。詳細については、'java-resolution-report.log' ファイルを参照してください。
ko: 참조된 Java 형식을 찾을 수 없기 때문에 일부 형식 또는 멤버를 바인딩할 수 없습니다. 자세한 내용은 'java-resolution-report.log' 파일을 참조하세요.
pl: Nie można powiązać niektórych typów lub elementów członkowskich, ponieważ nie można odnaleźć przywoływanych typów języka Java. Aby uzyskać szczegółowe informacje, zobacz plik „java-resolution-report.log”.
pt_br: Alguns tipos ou membros não puderam ser vinculados porque os tipos Java referenciados não puderam ser encontrados. Consulte o arquivo 'java-resolution-report.log' para obter detalhes.
ru: Некоторые типы или элементы не могут быть связаны, так как не удается найти ссылочные типы Java. Подробности в файле java-resolution-report.log.
tr: Başvurulan Java türleri bulunamadığından bazı türler veya üyeler bağlanamadı. Ayrıntılar için 'java-resolution-report.log' dosyasına bakın.
zh_hans: 无法绑定某些类型或成员，因为找不到引用的 Java 类型。有关详细信息，请参阅 “java-resolution-report.log” 文件。
zh_hant: 因為找不到參照的 JAVA 型別，所以無法繫結某些型別或成員。如需詳細資料，請參閱 'java-resolution-report.log' 檔案。

# Generator_BG8700
source: Unknown return type '{0}' for member '{1}'.
cs: Neznámý návratový typ {0} pro člena {1}.
de: Unbekannter Rückgabetyp '{0}' für Mitglied '{1}'.
es: Retorno desconocido tipo "{0}" para el miembro "{1}".
fr: Type de retour inconnu '{0}' pour le membre '{1}'.
it: Tipo restituito sconosciuto '{0}' per il membro '{1}'.
ja: メンバー '{1}' の戻り値の型 '{0}' が不明です。
ko: 멤버 '{1}'에 대한 알 수 없는 반환 형식 '{0}'.
pl: Nieznany zwracany typ „{0}” dla elementu członkowskiego „{1}”.
pt_br: Tipo de retorno desconhecido '{0}' para o membro '{1}'.
ru: Неизвестный тип возврата "{0}" для элемента "{1}".
tr: '{1}' üyesi için '{0}' dönüş türü bilinmiyor.
zh_hans: 成员“{1}”的返回类型“{0}”未知。
zh_hant: 成員 '{1}' 的傳回型別 '{0}' 未知。

# Generator_BG8701
source: Invalid return type '{0}' for member '{1}'.
cs: Neplatný návratový typ {0} pro člena {1}.
de: Ungültiger Rückgabetyp '{0}' für Mitglied '{1}'.
es: Retorno inválido tipo "{0}" para el miembro "{1}".
fr: Type de retour non valide '{0}' pour le membre '{1}'.
it: Tipo restituito non valido '{0}' per il membro '{1}'.
ja: メンバー '{1}' の戻り値の型 '{0}' が無効です。
ko: 멤버 '{1}'에 대한 잘못된 반환 형식 '{0}'.
pl: Nieprawidłowy zwracany typ „{0}” dla elementu członkowskiego „{1}”.
pt_br: Tipo de retorno inválido '{0}' para o membro '{1}'.
ru: Недопустимый тип возврата "{0}" для элемента "{1}".
tr: '{1}' üyesi için '{0}' dönüş türü geçersiz.
zh_hans: 成员“{1}”的返回类型“{0}”无效。
zh_hant: 成員 '{1}' 的傳回型別 '{0}' 無效。

# Generator_BG8800
source: Unknown parameter type '{0}' for member '{1}'.
cs: Neznámý typ parametru {0} pro člena {1}.
de: Unbekannter Parametertyp '{0}' für Mitglied '{1}'.
es: Parámetro desconocido tipo "{0}" para el miembro "{1}".
fr: Type de paramètre inconnu '{0}' pour le membre '{1}'.
it: Tipo di parametro sconosciuto '{0}' per il membro '{1}'.
ja: メンバー '{1}' のパラメーター型 '{0}' が不明です。
ko: 멤버 '{1}'에 대한 알 수 없는 매개 변수 형식 '{0}'.
pl: Nieznany typ parametru „{0}” dla elementu członkowskiego „{1}”.
pt_br: Tipo de parâmetro desconhecido '{0}' para o membro '{1}'.
ru: Неизвестный тип параметра "{0}" для элемента "{1}".
tr: '{1}' üyesi için '{0}' parametre türü bilinmiyor.
zh_hans: 成员“{1}”的参数类型“{0}”未知。
zh_hant: 成員 '{1}' 的參數型別 '{0}' 未知。

# Generator_BG8801
source: Invalid parameter type '{0}' for member '{1}'.
cs: Neplatný typ parametru {0} pro člen {1}.
de: Ungültiger Parametertyp '{0}' für Mitglied '{1}'.
es: Parámetro inválido tipo "{0}" para el miembro "{1}".
fr: Type de paramètre '{0}' non valide pour le membre '{1}'.
it: Tipo di parametro '{0}' non valido per il membro '{1}'.
ja: メンバー '{1}' のパラメーター型 '{0}' が無効です。
ko: '{1}' 멤버에 대한 매개 변수 형식 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowy typ parametru „{0}” dla elementu członkowskiego „{1}”.
pt_br: Tipo de parâmetro inválido '{0}' para o membro '{1}'.
ru: Недопустимый тип параметра "{0}" для элемента "{1}".
tr: '{1}' üyesi için '{0}' parametre türü geçersiz.
zh_hans: 成员“{1}”的参数类型“{0}”无效。
zh_hant: 成員 '{1}' 的參數型別 '{0}' 無效。

# Generator_BG8A00
source: Metadata.xml element '{0}' matched no nodes.
cs: Element Metadata.xml {0} neodpovídá žádným uzlům.
de: Metadata.xml Element '{0}' mit keinem Knoten übereinstimmen.
es: El elemento Metadata.xml "{0}" no tiene nodos.
fr: L'élément Metadata.xml '{0}' ne correspond à aucun nœud.
it: L'elemento Metadata.xml '{0}' non corrisponde ad alcun nodo.
ja: Metadata.xml 要素 '{0}' と一致するノードがありませんでした。
ko: Metadata.xml 요소 '{0}'이(가) 일치하는 노드가 없습니다.
pl: Element Metadata.xml „{0}” nie pasuje do węzłów.
pt_br: O elemento Metadata.xml '{0}' não correspondeu a nenhum nó.
ru: Для элемента Metadata.xml "{0}" нет соответствующего узла.
tr: '{0}' Metadata.xml öğesi hiçbir düğümle eşleşmedi.
zh_hans: Metadata.xml 元素“{0}”不匹配任何节点。
zh_hant: Metadata.xml 元素 '{0}' 與節點相符。

# Generator_BG8A07
source: Invalid namespace transform '{0}'
cs: Neplatná transformace oboru názvů {0}
de: Ungültige Namespacetransformation '{0}'
es: Transformación de espacio de nombres inválida "{0}"
fr: Transformation d'espace de noms non valide '{0}'
it: Trasformazione dello spazio dei nomi '{0}' non valida
ja: 名前空間の変換 '{0}' が無効です
ko: 잘못된 네임스페이스 변환 '{0}'
pl: Nieprawidłowe przekształcenie przestrzeni nazw „{0}”
pt_br: Transformação do namespace inválida '{0}'
ru: Недопустимое преобразование пространства имен "{0}"
tr: '{0}' ad alanı dönüşümü geçersiz.
zh_hans: 命名空间转换“{0}”无效
zh_hant: 命名空間轉換 '{0}' 無效

# Generator_BG8B00
source: Unknown generic argument constraint type '{0}' for member '{1}'.
cs: Neznámý typ omezení obecného argumentu {0} pro člena {1}.
de: Unbekannter generischer Argumenteinschränkungstyp '{0}' für Mitglied'{1}'.
es: Tipo de restricción genérica desconocida "{0}" para el miembro "{1}".
fr: Type de contrainte d'argument générique inconnu '{0}' pour le membre '{1}'.
it: Tipo di vincolo di argomento generico sconosciuto '{0}' per il membro '{1}'.
ja: メンバー '{1}' のジェネリック引数制約型 '{0}' が不明です。
ko: '{1}' 멤버에 대한 알 수 없는 일반 인수 제약 형식 '{0}'.
pl: Nieznany typ ograniczenia argumentu ogólnego „{0}” dla elementu członkowskiego „{1}”.
pt_br: Tipo de restrição de argumento genérico desconhecido '{0}' para o membro '{1}'.
ru: Неизвестный универсальный тип ограничения аргумента "{0}" для элемента "{1}".
tr: '{1}' üyesi için '{0}' genel bağımsız değişken kısıtlama türü bilinmiyor.
zh_hans: 成员“{1}”的泛型参数约束类型“{0}”未知。
zh_hant: 成員 '{1}' 的未知泛型引數限制式型別 '{0}'。

# Generator_BG8C00
source: Could not find base interface '{1}' for type '{0}'.
cs: Nelze najít základní rozhraní {1} pro typ {0}.
de: Die Basisschnittstelle '{1}' für den Typ '{0}' wurde nicht gefunden.
es: No se ha podido encontrar la interfaz base "{1}" para el tipo "{0}".
fr: Impossible de trouver l'interface de base '{1}' pour le type '{0}'.
it: Impossibile trovare l'interfaccia di base '{1}' per il tipo '{0}'.
ja: 型 '{0}' の基本インターフェイス '{1}' が見つかりませんでした。
ko: 형식 '{0}'에 대한 기본 인터페이스 '{1}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć interfejsu podstawowego „{1}” dla typu „{0}”.
pt_br: Não foi possível localizar a interface base '{1}' para o tipo '{0}'.
ru: Не удалось найти базовый интерфейс "{1}" для типа "{0}".
tr: '{0}' türü için '{1}' temel arabirimi bulunamadı.
zh_hans: 找不到类型“{0}”的基接口“{1}”。
zh_hant: 找不到型別 '{0}' 的基底介面 '{1}'。

# Generator_BG8C01
source: For type '{0}', base interface '{1}' is invalid.
cs: Pro typ {0} je základní rozhraní {1} neplatné.
de: Für den Typ '{0}' ist die Basisschnittstelle '{1}' ungültig.
es: Para el tipo "{0}", la interfaz base "{1}" no es válida.
fr: Pour le type '{0}', l'interface de base '{1}' n'est pas valide.
it: Per il tipo '{0}', l'interfaccia di base '{1}' non è valida.
ja: 型'{0}' では、基本インターフェイス '{1}' が無効です。
ko: 형식 '{0}'의 경우 기본 인터페이스 '{1}'이(가) 잘못되었습니다.
pl: W przypadku typu „{0}” interfejs podstawowy „{1}” jest nieprawidłowy.
pt_br: Para o tipo '{0}', a interface base '{1}' é inválida.
ru: Для типа "{0}" базовый интерфейс "{1}" является недопустимым.
tr: '{0}' türü için '{1}' temel arabirimi geçersiz.
zh_hans: 对于类型“{0}”，基接口“{1}”无效。
zh_hant: 針對型別 '{0}'，基底介面 '{1}' 無效。

# JavaCallableWrappers_XA4200
source: Cannot generate Java wrapper for type '{0}'. Only 'class' types are supported.
cs: Pro typ{0} nelze vygenerovat obálku Javy. Jsou podporovány pouze typy class.
de: Für den Typ '{0}' kann kein Java Wrapper generiert werden. Es werden nur class-Typen unterstützt.
es: No se puede generar el contenedor de Java para el tipo '{0}'. Solo se admiten tipos "class".
fr: Impossible de générer le wrapper Java pour le type '{0}'. Seulement les types de 'classe' sont pris en charge.
it: Non è possibile generare il wrapper Java per il tipo '{0}'. Sono supportati solo i tipi 'class'.
ja: 型 '{0}' の Java ラッパーを生成できません。'class' 型のみがサポートされています。
ko: 형식 '{0}'에 대한 Java 래퍼를 생성할 수 없습니다. '클래스' 형식만 지원됩니다.
pl: Nie można wygenerować otoki Języka Java dla typu „{0}”. Obsługiwane są tylko typy „class”.
pt_br: Não é possível gerar o wrapper Java para o tipo '{0}'. Somente tipos de 'classe' são suportados.
ru: Не удается создать оболочку Java для типа "{0}". Поддерживаются только типы "class".
tr: '{0}' türü için Java sarmalayıcı oluşturulamıyor. Yalnızca 'class' türleri desteklenir.
zh_hans: 无法为类型“{0}”生成 Java 包装器。仅支持 “class” 类型。
zh_hant: 無法產生型別 '{0}' 的 JAVA 包裝函式。只支援 'class' 型別。

# JavaCallableWrappers_XA4201
source: Cannot determine JNI name for type '{0}'.
cs: Nelze určit název JNI pro typ {0}.
de: Der JNI-Name für den Typ '{0}' kann nicht bestimmt werden.
es: No se puede determinar el nombre JNI para el tipo "{0}".
fr: Impossible de déterminer le nom JNI pour le type '{0}'.
it: Non è possibile determinare il nome JNI per il tipo '{0}'.
ja: 型 '{0}' の JNI 名を特定できません。
ko: 형식 '{0}'에 대한 JNI 이름을 결정할 수 없습니다.
pl: Nie można określić nazwy JNI dla typu „{0}”.
pt_br: Não é possível determinar o nome JNI para o tipo '{0}'.
ru: Не удается определить имя JNI для типа "{0}".
tr: '{0}' türü için JNI adı belirlenemiyor.
zh_hans: 无法确定类型“{0}”的 JNI 名称。
zh_hant: 無法判斷型別 '{0}' 的 JNI 名稱。

# JavaCallableWrappers_XA4203
source: The 'Name' property must be a fully qualified type like 'com.example.MyClass' and no package was found for '{0}'.
cs: Vlastnost Name musí být plně kvalifikovaný typ, například com.example.MyClass, a pro {0}nebyl nalezen žádný balíček.
de: Die Eigenschaft "Name" muss ein vollqualifizierter Typ wie "com.example.MyClass" sein, und es wurde kein Paket für '{0}' gefunden.
es: La propiedad "Name" debe ser un tipo completamente calificado como "com.example.MyClass" y no se encontró ningún paquete para "{0}".
fr: La propriété 'Name' doit être un type complet tel que 'com.example.MyClass' et aucun package n'a été trouvé pour '{0}'.
it: La proprietà 'Name' deve essere un tipo completo come 'com.example.MyClass' e non è stato trovato alcun pacchetto per '{0}'.
ja: 'Name' プロパティは 'com.example.MyClass' のような完全修飾型である必要があり、'{0}' のパッケージが見つかりませんでした。
ko: '이름' 속성은 'com.example.MyClass'와 같은 정규화된 형식이어야 하며 '{0}'에 대한 패키지를 찾을 수 없습니다.
pl: Właściwość „Name” musi być w pełni kwalifikowanym typem, takim jak „com.example.MyClass”, i nie znaleziono pakietu dla elementu „{0}”.
pt_br: A propriedade 'Name' deve ser um tipo totalmente qualificado como 'com.example.MyClass' e nenhum pacote foi encontrado para '{0}'.
ru: Свойство "Name" должно иметь полный тип, например "com.example.MyClass", и пакет для "{0}" не найден.
tr: 'Name' özelliği 'com.example.MyClass' gibi tam bir tür olmalıdır ve '{0}' için paket bulunamadı.
zh_hans: “Name” 属性必须是完全限定的类型，如 “com.example.MyClass”，并且找不到“{0}”的包。
zh_hant: 'Name' 屬性必須是如 'com.example.MyClass' 的完整型別，但找不到 '{0}' 的套件。

# JavaCallableWrappers_XA4204
source: Unable to resolve interface type '{0}'. Are you missing an assembly reference?
cs: Nelze přeložit typ rozhraní {0}. Nechybí vám odkaz na sestavení?
de: Der Schnittstellentyp '{0}' kann nicht aufgelöst werden. Fehlt ein Assemblyverweis?
es: No se puede resolver el tipo de interfaz "{0}". ¿Le falta una referencia de ensamblaje?
fr: Impossible de résoudre le type d'interface '{0}'. Il vous manque une référence d'assemblage ?
it: Impossibile risolvere il tipo di interfaccia '{0}'. Manca un riferimento all'assembly?
ja: インターフェイスの型 '{0}' を解決できません。アセンブリ参照が不足していないかどうかを確認してください。
ko: 인터페이스 형식 '{0}'을(를) 확인할 수 없습니다. 어셈블리 참조가 누락되었습니까?
pl: Nie można rozpoznać typu interfejsu „{0}”. Czy brakuje odwołania do zestawu?
pt_br: Não é possível resolver o tipo de interface '{0}'. Uma referência de assembly está ausente?
ru: Не удалось разрешить тип интерфейса "{0}". Отсутствует ссылка на сборку?
tr: '{0}' arabirim türü çözümlenemiyor. Derleme başvurusu eksik mi?
zh_hans: 无法解析接口类型“{0}”。是否缺少程序集引用?
zh_hant: 無法解析介面型別 '{0}'。您是否遺失組件參考?

# JavaCallableWrappers_XA4205
source: [ExportField] can only be used on methods with 0 parameters.
cs: [ExportField] lze použít pouze u metod s 0 parametry.
de: [ExportField] kann nur für Methoden mit 0 Parametern verwendet werden.
es: [ExportField] solo puede utilizarse en métodos con 0 parámetros.
fr: [ExportField] ne peut être utilisé que sur des méthodes avec 0 paramètres.
it: [ExportField] può essere utilizzato solo su metodi con 0 parametri.
ja: [ExportField] は、パラメーターが 0 個のメソッドでのみ使用できます。
ko: [ExportField]은(는) 매개 변수가 0인 메서드에만 사용할 수 있습니다.
pl: Elementu [ExportField] można używać tylko w metodach z parametrami 0.
pt_br: [ExportField] só pode ser usado em métodos com parâmetros 0.
ru: [ExportField] можно использовать только для методов с 0 параметрами.
tr: [ExportField] yalnızca 0 parametreli yöntemlerde kullanılabilir.
zh_hans: [ExportField] 只能用于具有 0 个参数的方法。
zh_hant: [ExportField] 只能在具有 0 個參數的方法上使用。

# JavaCallableWrappers_XA4206
source: [Export] cannot be used on a generic type.
cs: [Export] nelze použít u obecného typu.
de: [Export] kann nicht für einen generischen Typ verwendet werden.
es: No se puede utilizar [Exportar] en un tipo genérico.
fr: [Export] ne peut pas être utilisé sur un type générique.
it: [Export] non può essere utilizzato in un tipo generico.
ja: [Export] はジェネリック型では使用できません。
ko: [내보내기]는 제네릭 형식에 사용할 수 없습니다.
pl: Nie można użyć elementu [Export] dla typu ogólnego.
pt_br: [Export] não pode ser usado em um tipo genérico.
ru: [Export] нельзя использовать для универсального типа.
tr: [Export] genel türde kullanılamaz.
zh_hans: [Export] 不能用于泛型类型。
zh_hant: [Export] 無法用於泛型型別。

# JavaCallableWrappers_XA4207
source: [ExportField] cannot be used on a generic type.
cs: [ExportField] nelze použít u obecného typu.
de: [ExportField] kann nicht für einen generischen Typ verwendet werden.
es: No se puede utilizar [ExportField] en un tipo genérico.
fr: [ExportField] ne peut pas être utilisé sur un type générique.
it: [ExportField] non può essere utilizzato in un tipo generico.
ja: [ExportField] はジェネリック型では使用できません。
ko: [ExportField]은(는) 제네릭 형식에 사용할 수 없습니다.
pl: Nie można użyć elementu [ExportField] dla typu ogólnego.
pt_br: [ExportField] não pode ser usado em um tipo genérico.
ru: [ExportField] нельзя использовать для универсального типа.
tr: [ExportField] genel türde kullanılamaz.
zh_hans: [ExportField] 不能用于泛型类型。
zh_hant: [Export] 無法用於泛型型別。

# JavaCallableWrappers_XA4208
source: [ExportField] cannot be used on a method returning 'void'.
cs: [ExportField] se nedá použít u metody, která vrací void.
de: [ExportField] kann nicht für eine Methode verwendet werden, die "void" zurückgibt.
es: No se puede utilizar [ExportField] en un método que devuelve "void".
fr: [ExportField] ne peut pas être utilisé sur une méthode retournant 'void'.
it: impossibile utilizzare [ExportField] su un metodo che restituisce 'void'.
ja: 'void' を返すメソッドでは、[ExportField] を使用できません。
ko: [ExportField]은(는) 'void'를 반환하는 메서드에 사용할 수 없습니다.
pl: Nie można użyć elementu [ExportField] w metodzie zwracającej wartość „void”.
pt_br: [ExportField] não pode ser usado em um método que retorna 'void'.
ru: [ExportField] нельзя использовать для метода, возвращающего "void".
tr: [ExportField] 'void' döndüren bir yöntemde kullanılamaz.
zh_hans: [ExportField] 不能用于返回 “void” 的方法。
zh_hant: [ExportField] 無法用於傳回 'void' 的方法。
