Repository: dotnet/java-interop
Catalog: src/Java.Interop.Localization/Resources.*.resx
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JavaCallableWrappers_XA4217
source: Cannot override Kotlin-generated method '{0}' because it is not a valid Java method name. This method can only be overridden from Kotlin.
cs: Metodu '{0}' vygenerovanou metodou Kotlin nelze přepsat, protože se nejedná o platný název metody Java. Tuto metodu lze přepsat pouze přes Kotlin.
de: Die von Kotlin generierte Methode '{0}' kann nicht überschrieben werden, da es sich nicht um einen gültigen Java-Methodennamen handelt. Diese Methode kann nur von Kotlin überschrieben werden.
es: El método generado por Kotlin "{0}" no puede ser anulado debido a que no es un nombre de método Java válido. Este método sólo puede ser anulado desde Kotlin.
fr: Impossible de remplacer la méthode générée par Kotlin '{0}' car il ne s'agit pas d'un nom de méthode Java valide. Cette méthode ne peut être remplacée qu'à partir de Kotlin.
it: Non è possibile eseguire l'override del metodo generato da Kotlin '{0}' perché non è un nome di metodo Java valido. Questo metodo può essere sostituito solo da Kotlin.
ja: Kotlin で生成されたメソッド '{0}' は有効な Java メソッド名ではないため、オーバーライドできません。このメソッドは Kotlin からのみオーバーライドできます。
ko: 유효한 Java 메소드 이름이 아니기 때문에 Kotlin 생성 메소드 '{0}'을(를) 재정의할 수 없습니다. 이 메서드는 Kotlin에서만 재정의할 수 있습니다.
pl: Nie można przesłonić metody wygenerowanej przez metodę Kotlin „{0}”, ponieważ nie jest to prawidłowa nazwa metody Java. Tę metodę można zastąpić tylko za pomocą języka Kotlin.
pt_br: Não é possível substituir o método gerado pelo Kotlin '{0}' porque ele não é um nome de método Java válido. Esse método só pode ser substituído a partir do Kotlin.
ru: Невозможно переопределить сгенерированный Kotlin метод "{0}", так как это недопустимое имя метода Java. Этот метод можно переопределить только из Kotlin.
tr: Geçerli bir Java yöntem adı olmadığından Kotlin’de oluşturulan '{0}' yöntemi geçersiz kılınamıyor. Bu yöntem yalnızca Kotlin'den geçersiz kılınabilir.
zh_hans: 无法替代 Kotlin 生成的方法“{0}”，因为它不是有效的 Java 方法名称。只能从 Kotlin 替代此方法。
zh_hant: 無法覆寫 Kotlin 產生的方法 '{0}'，因為它不是有效的 JAVA 方法名稱。此方法只能從 Kotlin 覆寫。

# JniMarshalMethodGen_JM4001
source: Unable to preload reference '{0}'.
cs: Odkaz {0} nelze předem načíst {0}.
de: Verweis '{0}' kann nicht vorab geladen werden.
es: No se ha podido precargar la referencia "{0}".
fr: Impossible de précharger la référence '{0}'.
it: Non è possibile precaricare il riferimento '{0}'.
ja: 参照 '{0}' を事前に読み込むことができません。
ko: 참조 '{0}'을(를) 미리 로드할 수 없습니다.
pl: Nie można wstępnie załadować odwołania „{0}”.
pt_br: Não é possível pré-carregar a referência '{0}'.
ru: Не удалось предварительно загрузить ссылку "{0}".
tr: '{0}' başvurusu önceden yüklenemiyor.
zh_hans: 无法预加载引用“{0}”。
zh_hant: 無法預先載入參考 '{0}'。

# JniMarshalMethodGen_JM4002
source: Please specify at least one ASSEMBLY to process.
cs: Zadejte alespoň jedno SESTAVENÍ, které se má zpracovat.
de: Geben Sie mindestens eine ASSEMBLY an, die verarbeitet werden soll.
es: Especifique al menos un ENSAMBLADO a procesar.
fr: Veuillez spécifier au moins un ENSEMBLE à traiter.
it: Specificare almeno un ASSEMBLY da elaborare.
ja: 処理する ASSEMBLY を少なくとも 1 つ指定してください。
ko: 처리할 ASSEMBLY를 하나 이상 지정하세요.
pl: Określ co najmniej jeden ZESTAW do przetworzenia.
pt_br: Especifique pelo menos um ASSEMBLY para processar.
ru: Укажите по крайней мере одну СБОРКУ для обработки.
tr: Lütfen işlemek için en az bir ASSEMBLY belirtin.
zh_hans: 请至少指定一个要处理的程序集。
zh_hant: 請至少指定一個要處理的組件。

# JniMarshalMethodGen_JM4003
source: Unable to create Java VM{0}{1}
cs: Nepovedlo se vytvořit{0}{1}virtuálního počítače Java
de: Java-VM {0}{1} kann nicht erstellt werden.
es: No se puede crear Java VM{0}{1}
fr: Impossible de créer la machine virtuelle Java{0}{1}
it: Non è possibile creare la macchina virtuale Java{0}{1}
ja: Java VM{0}{1} を作成できません
ko: Java VM을 생성할 수 없음{0}{1}
pl: Nie można utworzyć maszyny wirtualnej Java{0}{1}
pt_br: Não é possível criar a VM Java{0}{1}
ru: Не удалось создать Java VM{0}{1}
tr: Java VM hesabı oluşturulamıyor{0}{1}
zh_hans: 无法创建 Java VM{0}{1}
zh_hant: 無法建立 JAVA VM{0}{1}

# JniMarshalMethodGen_JM4004
source: Unable to read profile file '{0}'.{1}{2}
cs: Nelze přečíst soubor profilu {0}.{1}{2}
de: Profildatei „{0}“ kann nicht gelesen werden.{1}{2}
es: No se puede leer el archivo de perfil "{0}".{1}{2}
fr: Impossible de lire le fichier de profil '{0}'.{1}{2}
it: Impossibile leggere il file del profilo '{0}'.{1}{2}
ja: プロフィール ファイル '{0}' を読み取れません。{1}{2}
ko: 프로필 파일 '{0}'을(를) 읽을 수 없습니다.{1}{2}
pl: Nie można odczytać pliku profilu „{0}”.{1}{2}
pt_br: Não é possível ler o arquivo de perfil '{0}'.{1}{2}
ru: Не удалось прочитать файл профиля "{0}".{1}{2}
tr: '{0}' profil dosyası okunamıyor.{1}{2}
zh_hans: 无法读取配置文件“{0}”。{1}{2}
zh_hant: 無法讀取設定檔檔案 '{0}'.{1}{2}

# JniMarshalMethodGen_JM4005
source: Path '{0}' does not exist.
cs: Cesta {0} neexistuje.
de: Der Pfad „{0}“ ist nicht vorhanden.
es: La ruta "{0}" no existe.
fr: Le chemin '{0}' n'existe pas.
it: Il percorso '{0}' non esiste.
ja: パス '{0}' が存在しません。
ko: 경로 '{0}'이(가) 존재하지 않습니다.
pl: Ścieżka „{0}” nie istnieje.
pt_br: Caminho '{0}' inexistente.
ru: Путь "{0}" не существует
tr: '{0}' yolu yok.
zh_hans: 路径“{0}”不存在。
zh_hant: 路徑 '{0}' 不存在。

# JniMarshalMethodGen_JM4006
source: Unable to process assembly '{0}'{1}{2}{1}{3}
cs: Sestavení{0}{1}{2}{1}{3} nelze zpracovat.
de: Die Assembly '{0}'{1}{2}{1}{3} kann nicht verarbeitet werden.
es: No se puede procesar el ensamblado "{0}"{1}{2}{1}{3}
fr: Impossible de traiter l'assemblage '{0}'{1}{2}{1}{3}
it: Impossibile elaborare l'assembly '{0}'{1}{2}{1}{3}
ja: アセンブリ '{0}' を処理できません{1}{2}{1}{3}
ko: 어셈블리 '{0}'{1}{2}{1}{3}을(를) 처리할 수 없습니다.
pl: Nie można przetworzyć zestawu „{0}”{1}{2}{1}{3}
pt_br: Não é possível processar o assembly '{0}'{1}{2}{1}{3}
ru: Не удалось обработать сборку "{0}"{1}{2}{1}{3}
tr: '{0}' derlemesi işlenemiyor{1}{2}{1}{3}
zh_hans: 无法处理程序集“{0}”{1}{2}{1}{3}
zh_hant: 無法處理組件 '{0}'{1}{2}{1}{3}

# JniMarshalMethodGen_JM8001
source: Couln't find interface {0}
cs: Nepovedlo se najít rozhraní {0}.-
de: Schnittstelle {0} nicht gefunden
es: No se encuentra la interfaz {0}
fr: Impossible de trouver l'interface {0}
it: Non è stato possibile trovare l'interfaccia {0}
ja: インターフェイス {0}が見つかりませんでした
ko: 인터페이스 {0}을(를) 찾을 수 없습니다.
pl: Nie znaleziono interfejsu {0}
pt_br: Não foi possível encontrar a interface {0}
ru: Не удается найти интерфейс {0}
tr: {0} arabirimi bulunamadı.
zh_hans: 找不到接口 {0}
zh_hant: 找不到介面 {0}

# JniMarshalMethodGen_JM8003
source: Caught an exception while loading types. The types that cannot be loaded will not be processed. Make sure that any additional assembly references required for those types are provided using the -r option. Exception:{0}{1}
cs: Při načítání typů byla zachycena výjimka. Typy, které nelze načíst, nebudou zpracovány. Ujistěte se, že všechny další odkazy na sestavení vyžadované pro tyto typy jsou k dispozici pomocí možnosti -r. Výjimka:{0}{1}
de: Ausnahme beim Laden von Typen. Die Typen, die nicht geladen werden können, werden nicht verarbeitet. Stellen Sie sicher, dass alle zusätzlichen Assemblyverweise, die für diese Typen erforderlich sind, mithilfe der Option "-r" bereitgestellt werden. Ausnahme:{0}{1}
es: Se ha producido una excepción al cargar los tipos. Los tipos que no pueden ser cargados no serán procesados. Asegúrese de que las referencias de ensamblaje adicionales necesarias para esos tipos se proporcionan utilizando la opción -r. Excepción:{0}{1}
fr: A intercepté une exception lors du chargement des types. Les types qui ne peuvent pas être chargés ne seront pas traités. Assurez-vous que toutes les références d'assembly supplémentaires requises pour ces types sont fournies à l'aide de l'option -r. Exception : {0}{1}
it: È stata rilevata un'eccezione durante il caricamento dei tipi. I tipi che non possono essere caricati non verranno elaborati. Assicurarsi che tutti i riferimenti ad assembly aggiuntivi necessari per questi tipi vengano forniti usando l'opzione -r. Eccezione:{0}{1}
ja: 型の読み込み中に例外が発生しました。読み込めない型は処理されません。これらの型に必要な追加のアセンブリ参照が -r オプションを使用して指定されていることを確認してください。例外:{0}{1}
ko: 형식을 로드하는 동안 예외가 발생했습니다. 로드할 수 없는 형식은 처리되지 않습니다. 해당 형식에 필요한 추가 어셈블리 참조가 -r 옵션을 사용하여 제공되었는지 확인하세요. 예외:{0}{1}
pl: Przechwycono wyjątek podczas ładowania typów. Typy, których nie można załadować, nie zostaną przetworzone. Upewnij się, że wszelkie dodatkowe odwołania do zestawów wymagane dla tych typów są dostarczane przy użyciu opcji -r. Wyjątek:{0}{1}
pt_br: Capturou uma exceção ao carregar tipos. Os tipos que não podem ser carregados não serão processados. Verifique se todas as referências de assembly adicionais necessárias para esses tipos foram fornecidas usando a opção -r. Exceção:{0}{1}
ru: Перехвачено исключение при загрузке типов. Типы, которые невозможно загрузить, не будут обработаны. Убедитесь, что любые дополнительные ссылки на сборки, необходимые для этих типов, предоставляются с помощью параметра -r. Исключение:{0}{1}
tr: Türler yüklenirken bir özel durum yakalandı. Yüklenemeyen türler işlenmeyecek. Bu türler için gereken ek derleme başvurularının -r seçeneği kullanılarak sağlanmış olduğundan emin olun. Özel durum:{0}{1}
zh_hans: 加载类型时捕获到异常。将不处理无法加载的类型。请确保使用 -r 选项提供这些类型所需的任何其他程序集引用。异常:{0}{1}
zh_hant: 載入型別時發生例外狀況。將不會處理無法載入的型別。請確定已使用 -r 選項提供這些型別所需的任何其他組件參考。例外狀況: {0}{1}

# JniMarshalMethodGen_JM8004
source: Unable to find type '{0}'. The type will not be processed. Make sure the directories for all referenced assemblies are provided with the -L option.
cs: Nelze najít typ {0}. Typ nebude zpracován. Ujistěte se, že adresáře pro všechna odkazovaná sestavení jsou k dispozici s parametrem -L.
de: Typ '{0}' wurde nicht gefunden. Es wird nicht verarbeitet. Stellen Sie sicher, dass die Verzeichnisse für alle Assemblys, auf die verwiesen wird, mit der Option -L bereitgestellt werden.
es: No se puede encontrar el tipo "{0}". El tipo no será procesado. Asegúrese de que los directorios de todos los ensamblados referenciados se proporcionan con la opción -L.
fr: Impossible de trouver le type '{0}'. Le type ne sera pas traité. Assurez-vous que les répertoires de tous les assemblys référencés sont fournis avec l'option -L.
it: Impossibile trovare il tipo '{0}'. Il tipo non verrà elaborato. Assicurarsi che le directory per tutti gli assembly a cui si fa riferimento siano fornite con l'opzione -L.
ja: 型 '{0}' が見つかりません。この型は処理されません。参照されているすべてのアセンブリのディレクトリに -L オプションが指定されていることを確認してください。
ko: 형식 '{0}'을(를) 찾을 수 없습니다. 형식이 처리되지 않습니다. 참조된 모든 어셈블리의 디렉터리에 -L 옵션이 제공되었는지 확인합니다.
pl: Nie można odnaleźć typu „{0}”. Typ nie zostanie przetworzony. Upewnij się, że katalogi dla wszystkich przywoływanych zestawów są dostarczane z opcją -L.
pt_br: Não é possível localizar o tipo '{0}'. O tipo não será processado. Verifique se os diretórios de todos os assemblies referenciados foram fornecidos com a opção -L.
ru: Не удалось найти тип "{0}". Тип не будет обработан. Убедитесь, что каталоги для всех сборок, на которые есть ссылки, предоставляются с параметром -L.
tr: '{0}' türü bulunamıyor. Tür işlenmeyecek. Başvurulan tüm derlemelere ait dizinlerin -L seçeneğiyle sağlanmış olduğundan emin olun.
zh_hans: 找不到类型“{0}”。将不会处理该类型。确保使用 -L 选项提供所有引用的程序集的目录。
zh_hant: 找不到型別 '{0}'。型別將不會處理。請確定所有參考組件的目錄都是以 -L 選項提供。

# JniMarshalMethodGen_JM8005
source: Marshal methods type '{0}' already exists. Skipped generation of marshal methods in assembly '{1}'. Use -f to force regeneration when desired.
cs: Typ metody zařazování{0}již existuje. Bylo přeskočeno generování zařazování metod v sestavení{1}. Pokud chcete vynutit opakované generování, použijte -f.použití.
de: Der Marshallmethodentyp '{0}' bereits vorhanden. Das Generieren von Marshallmethoden in assembly-'{1}' wurde übersprungen. Verwenden Sie -f, um bei Bedarf eine Neuerstellung zu erzwingen.
es: Los métodos Marshal de tipo "{0}" ya existen. Se ha omitido la generación de métodos Marshal en el ensamblado "{1}". Utilice -f para forzar la regeneración cuando lo desee.
fr: Le type de méthodes Marshal '{0}' existe déjà. Génération ignorée des méthodes marshal dans l'assembly '{1}'. Utilisez -f pour forcer la régénération lorsque vous le souhaitez.
it: Il tipo di metodi di marshalling '{0}' esiste già. La generazione dei metodi di marshalling nell'assembly '{1}' è stata ignorata. Usare -f per forzare la rigenerazione quando si desidera.
ja: マーシャリング メソッドの型 '{0}' は既に存在します。アセンブリ '{1}' でマーシャリング メソッドの生成をスキップしました。-f を使用して、必要に応じて再生成を強制してください。
ko: 마샬 메소드 형식 '{0}'이(가) 이미 존재합니다. 어셈블리 '{1}'에서 마샬 메서드 생성을 건너뛰었습니다. 원하는 경우 -f를 사용하여 재생성을 강제 실행합니다.
pl: Typ metod marshalingu „{0}” już istnieje. Pominięto generowanie metod marshalingu w zestawie „{1}”. Użyj -f, aby wymusić ponowne wygenerowanie w razie potrzeby.
pt_br: O tipo de métodos marshaling '{0}' já existe. Foi ignorada a geração de métodos marshaling no assembly '{1}'. Use -f para forçar a regeneração quando desejar.
ru: Тип методов маршалирования "{0}" уже существует. Пропущено поколение методов маршалирования в сборке "{1}". При желании используйте -f для принудительного повторного создания.
tr: '{0}' türü sıralama yöntemleri zaten var. '{1}' adlı derlemede sıralama yöntemlerinin oluşturulması atlandı. İstendiğinde yeniden oluşturmayı zorlamak için -f kullanın.
zh_hans: 封送方法类型“{0}”已存在。已跳过程序集“{1}”中封送方法的生成。在需要时使用 -f 强制重新生成。
zh_hant: 封送處理方法型別 '{0}' 已存在。已略過在組件 '{1}' 中產生封送處理方法。使用 -f 在需要時強制重新產生。

# JniMarshalMethodGen_JM8006
source: Unable to find definition of method '{0}' in assembly metadata. It will not be processed. Make sure the directories for all referenced assemblies are provided with the -L option.
cs: Nelze najít definici metody {0} v metadatech sestavení. Nebude zpracována. Ujistěte se, že adresáře pro všechna odkazovaná sestavení jsou k dispozici s parametrem -L.
de: Die Definition der Methode '{0}' wurde in den Assemblymetadaten nicht gefunden. Es wird nicht verarbeitet. Stellen Sie sicher, dass die Verzeichnisse für alle Assemblys, auf die verwiesen wird, mit der Option -L bereitgestellt werden.
es: No se ha podido encontrar la definición del método "{0}" en los metadatos del ensamblado. No será procesado. Asegúrese de que los directorios de todos los ensamblajes referenciados se proporcionan con la opción -L.
fr: Impossible de trouver la définition de la méthode '{0}' dans les métadonnées de l'assembly. Il ne sera pas traité. Assurez-vous que les répertoires de tous les assemblys référencés sont fournis avec l'option -L.
it: Impossibile trovare la definizione del metodo '{0}' nei metadati dell'assembly. Non verrà elaborato. Verificare che le directory per tutti gli assembly di riferimento siano fornite con l'opzione -L.
ja: アセンブリ メタデータにメソッド '{0}' の定義が見つかりません。このメソッドは処理されません。参照されているすべてのアセンブリのディレクトリに -L オプションが指定されていることを確認してください。
ko: 어셈블리 메타데이터에서 '{0}' 메서드의 정의를 찾을 수 없습니다. 처리되지 않습니다. 참조된 모든 어셈블리의 디렉터리에 -L 옵션이 제공되었는지 확인합니다.
pl: Nie można odnaleźć definicji metody „{0}” w metadanych zestawu. Nie zostanie on przetworzony. Upewnij się, że katalogi dla wszystkich przywoływanych zestawów są dostarczane z opcją -L.
pt_br: Não é possível encontrar a definição do método '{0}' nos metadados do assembly. Não será processado. Verifique se os diretórios de todos os assemblies referenciados foram fornecidos com a opção -L.
ru: Не удалось найти определение метода "{0}" в метаданных сборки. Он не будет обработан. Убедитесь, что каталоги для всех сборок, на которые есть ссылки, предоставляются с параметром -L.
tr: Derleme meta verilerinde '{0}' yönteminin tanımı bulunamıyor. İşlenmeyecek. Başvurulan tüm derlemelere ait dizinlerin -L seçeneğiyle sağlanmış olduğundan emin olun.
zh_hans: 在程序集元数据中找不到方法“{0}”的定义。将不会处理它。确保使用 -L 选项提供所有引用的程序集的目录。
zh_hant: 在組件中繼資料中找不到方法 '{0}' 的定義。將不會處理。請確定所有參考組件的目錄都是以 -L 選項提供。

# JniMarshalMethodGen_JM8007
source: Unable to find the System.Console.WriteLine() method. Disabling debug injection. To enable debug injection, ensure the directory containing mscorlib is provided with the -L option.
cs: Nelze najít metodu System.Console.WriteLine(). Zakazuje se injektáž ladění. Pokud chcete povolit injektáž ladění, ujistěte se, že adresář obsahující knihovnu mscorlib je k dispozici s parametrem -L.
de: Die System.Console.WriteLine()-Methode wurde nicht gefunden. Debuginjektion wird deaktiviert. Um die Debuginjektion zu aktivieren, stellen Sie sicher, dass das Verzeichnis, das mscorlib enthält, mit der Option -L bereitgestellt wird.
es: No se puede encontrar el método System.Console.WriteLine(). Desactivación de la inserción de la depuración. Para habilitar la inserción de depuración, asegúrese de que el directorio que contiene mscorlib se proporciona con la opción -L.
fr: Impossible de trouver la méthode System.Console.WriteLine(). Désactivation de l'injection de débogage. Pour activer l'injection de débogage, assurez-vous que le répertoire contenant mscorlib est fourni avec l'option -L.
it: Impossibile trovare il metodo System.Console.WriteLine(). Disabilitazione dell'inserimento del debug. Per abilitare l'inserimento del debug, assicurarsi che la directory contenente mscorlib sia fornita con l'opzione -L.
ja: System.Console.WriteLine() メソッドが見つかりません。デバッグ インジェクションを無効にしています。デバッグ インジェクションを有効にするには、mscorlib を含むディレクトリに -L オプションが指定されていることを確認してください。
ko: System.Console.WriteLine() 메서드를 찾을 수 없습니다. 디버그 주입을 비활성화합니다. 디버그 삽입을 활성화하려면 mscorlib가 포함된 디렉터리에 -L 옵션이 제공되었는지 확인합니다.
pl: Nie można odnaleźć metody System.Console.WriteLine(). Wyłączanie iniekcji debugowania. Aby włączyć iniekcję debugowania, upewnij się, że katalog zawierający plik mscorlib jest dostarczany z opcją -L.
pt_br: Não é possível encontrar o método System.Console.WriteLine(). Desativando a injeção de depuração. Para habilitar a injeção de depuração, verifique se o diretório que contém o mscorlib foi fornecido com a opção -L.
ru: Не удалось найти метод System.Console.WriteLine(). Отключение внедрения отладки. Чтобы включить внедрение отладки, убедитесь, что каталог, содержащий mscorlib, указан с параметром -L.
tr: System.Console.WriteLine() yöntemi bulunamıyor. Hata ayıklama ekleme devre dışı bırakılıyor. Hata ayıklama eklemeyi etkinleştirmek için mscorlib içeren dizinin -L seçeneğiyle sağlanmış olduğundan emin olun.
zh_hans: 找不到 System.Console.WriteLine() 方法。正在禁用调试注入。要启用调试注入，请确保使用 -L 选项提供包含 mscorlib 的目录。
zh_hant: 找不到 System.Console.WriteLine() 方法。正在停用偵錯插入。若要啟用偵錯插入，請確認已使用 -L 選項提供包含 mscorlib 的目錄。
